In [1]:
import mysql.connector as conn

In [2]:
mydb=conn.connect(host="localhost", user="root", password="r@shika123")

In [3]:
cursor=mydb.cursor()

In [4]:
cursor.execute("show databases")
cursor.fetchall()

[('information_schema',),
 ('mysql',),
 ('organisation',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('testrashika1',),
 ('testrashika11',),
 ('testrashika112',),
 ('world',)]

In [5]:
cursor.execute("use organisation")

In [6]:
cursor.execute("show tables")

In [7]:
cursor.fetchall()

[('employee',), ('employee1',), ('employee_email',), ('worker_table',)]

In [10]:
cursor.execute("insert into organisation.employee values(10,'Ranjana D','JP NAGAR',158800,'Ayrsh')")
cursor.execute("insert into organisation.employee values(11,'Rohit k','KAMLA NAGAR',158000,'Azalea')")
cursor.execute("insert into organisation.employee values(12,'Rupa G','OP NAGAR',258000,'Azle')")
cursor.execute("insert into organisation.employee values(13,'Rishi P','GT NAGAR',358000,'Aztec')")
cursor.execute("insert into organisation.employee values(14,'Raju D','GTB NAGAR',458000,'Azure')")
cursor.execute("insert into organisation.employee values(15,'Reena D','MG NAGAR',558000,'Azusa')")

In [11]:
mydb.commit()

# Q-1). Write an SQL query to show only odd rows from aÂ table.

In [15]:
cursor.execute("select* from employee where emp_id%2=1")

In [16]:
cursor.fetchall()

[(11, 'Rohit k', 'KAMLA NAGAR', 158000, 'Azalea'),
 (13, 'Rishi P', 'GT NAGAR', 358000, 'Aztec'),
 (15, 'Reena D', 'MG NAGAR', 558000, 'Azusa')]

# Q-2) Write an SQL query to clone a new table from another table.

In [17]:
# First create a new table to clone data from existing table.
cursor.execute(" create table employee_new (emp_id int, name varchar(30), salary int)")

In [18]:
cursor.execute(" insert into employee_new select emp_id, name, salary from employee ")

In [19]:
mydb.commit()

In [20]:
import pandas as pd
pd.read_sql('select * from organisation.employee_new',mydb)

   emp_id       name  salary
0      10  Ranjana D  158800
1      10  Ranjana D  158800
2      10  Ranjana D  158800
3      11    Rohit k  158000
4      12     Rupa G  258000
5      13    Rishi P  358000
6      14     Raju D  458000
7      15    Reena D  558000

In [21]:
import pandas as pd
pd.read_sql('select * from organisation.employee',mydb)

   emp_id       Name      Address  Salary      City
0      10  Ranjana D     JP NAGAR  158800  Ayrshire
1      10  Ranjana D     JP NAGAR  158800  Ayrshire
2      10  Ranjana D     JP NAGAR  158800     Ayrsh
3      11    Rohit k  KAMLA NAGAR  158000    Azalea
4      12     Rupa G     OP NAGAR  258000      Azle
5      13    Rishi P     GT NAGAR  358000     Aztec
6      14     Raju D    GTB NAGAR  458000     Azure
7      15    Reena D     MG NAGAR  558000     Azusa

In [22]:
# From line number 20 and 21, we conclude that employee_new is clone table of employee.

                                     Keep Learning, Keep Growing...